#Date Pre-processing Using Pandas

##Demo 3: Group By - Use Case 1

In [2]:
# Import pandas
import pandas as pd

# Read the input file into a Dataframe
data = pd.read_csv("worldcup.csv")

# Display the first five rows of the Dataframe
data.head()

          Team  Rank  Year
0  West Indies     7  1975
1  West Indies     7  1979
2        India     2  1983
3    Australia     1  1987
4     Pakistan     6  1992

In [4]:
print(data.groupby('Team').groups)

{'Australia': [3, 6, 7, 8, 10], 'India': [2, 9], 'Pakistan': [4], 'Sri Lanka': [5], 'West Indies': [0, 1]}

In [7]:
print(data.groupby('Team').count())

             Rank  Year
Team
Australia       5     5
India           2     2
Pakistan        1     1
Sri Lanka       1     1
West Indies     2     2

In [ ]:
#We can create a object reference and the same object can be used in the following code of lines
#dataframe.groupby()
team_groups=data.groupby('Team')
team_groups

In [9]:
group=team_groups.groups
group

{'Australia': [3, 6, 7, 8, 10], 'India': [2, 9], 'Pakistan': [4], 'Sri Lanka': [5], 'West Indies': [0, 1]}

In [11]:
India_group=team_groups.get_group('India')
India_group

    Team  Rank  Year
2  India     2  1983
9  India     2  2011

In [18]:
team_stats=team_groups['Rank'].agg(['mean','max'])
team_stats

             mean  max
Team
Australia     1.0    1
India         2.0    2
Pakistan      6.0    6
Sri Lanka     4.0    4
West Indies   7.0    7

#### Conclusion: Using groupby we combine data in various forms